/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yuseiikeda <yuseiikeda@student.42.fr>      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/07 19:48:02 by yuseiikeda        #+#    #+#             */
/*   Updated: 2022/04/20 21:58:50 by yuseiikeda       ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <unistd.h>

int	ft_isprint(int c)
{
	return (32 <= c && c <= 126);
}

// int main(void)
// {
//     int c;
//     c = 'a';

//     printf("%d",ft_isprint(c));
// }

/*
1,印字文字かどうかを判定する、印字文字であれば1を返しそれ以外であれば0を返す
*/